#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.manage_roles will be updated in-place
  ~ resource "aws_iam_policy" "manage_roles" {
        id          = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/ManageRoles"
        name        = "ManageRoles"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (1 unchanged element hidden)
                            "iam:PutRolePolicy",
                          - "iam:CreateRole",
                          - "iam:AttachRolePolicy",
                          - "iam:GetRole",
                            "iam:ListRolePolicies",
                          + "iam:ListInstanceProfilesForRole",
                            "iam:ListAttachedRolePolicies",
                          + "iam:GetRole",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.test_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "test_role" {
      ~ arn                   = "arn:aws:iam::327110749334:role/IacGhcPipelineResourceManagerRoles/test_role" -> (known after apply)
      ~ create_date           = "2024-03-15T19:08:08Z" -> (known after apply)
      ~ id                    = "test_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "test_role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAUYKKR5SLDCVP7H5YT" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
